GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/drivers/gps.c
	dev_gps_write( &dev_gps, 0, buf, 18 );

	ch_l = 1;
	while( ch_l )
	{
		res = rt_mq_recv( &mq_gps, (void*)&uart_buf, NEMA_SIZE, RT_TICK_PER_SECOND * 10 );
		if( res == RT_EOK )       //收到一包数据
		{

			if( ( uart_buf.wr == 11 ) && ( uart_buf.body[4] == 0xf2 ) )
			{
				ch_l = 0;
			}
		}else /*超时*/
		{
			msg( "E开始升级错误" );
			
			goto end_upgrade_usb_2;
		}
	}

/*发送数据包*/
	count		= 0;        /*计算发送字节数*/
	packet_num	= 0;
	read( fd, buf, 15 );    /*跳过文件头*/
//	rt_kprintf( "fd=%02x\r\n", fd );
	while( 1 )
	{
		rt_thread_delay( RT_TICK_PER_SECOND / 2 );
		memcpy( ptr_mem_packet, "\x40\xf2\x00\x00\x03\x01", 6 );
		res = read( fd, ptr_mem_packet + 6, READ_PACKET_SIZE );
		if( res < 0 )
		{
			msg( "E读取文件出错" );
			goto end_upgrade_usb_2;
		}

		count += res;
		if( res == READ_PACKET_SIZE )           /*判断是否为最后一包*/
		{
			if( count == file_datalen )         /*长度正为1012整数倍*/
			{
				ptr_mem_packet[2]	= 0x80 | ( packet_num >> 8 );
				ptr_mem_packet[3]	= packet_num & 0xff;
				res					= res - 6;
			}else
			{
				if( count == READ_PACKET_SIZE ) /*第一包*/
				{
					ptr_mem_packet[2]	= 0x40 | ( packet_num >> 8 );
					ptr_mem_packet[3]	= packet_num & 0xff;
				}else
				{
					ptr_mem_packet[2]	= packet_num >> 8;
					ptr_mem_packet[3]	= packet_num & 0xff;
				}
			}
		}else
		{
			ptr_mem_packet[2]	= 0x80 | ( packet_num >> 8 );
			ptr_mem_packet[3]	= packet_num & 0xff;
			/*去掉文件尾部的数据*/
			res = res - 6;
		}
		packet_num++;
		ptr_mem_packet[res + 6]		= ( res + 2 ) >> 8;
		ptr_mem_packet[res + 7]		= ( res + 2 ) & 0xff;
		crc							= CalcCRC16( ptr_mem_packet, 1, res + 7 );
		ptr_mem_packet[res + 8]		= ( crc & 0xff00 ) >> 8;
		ptr_mem_packet[res + 9]		= crc & 0xff;
		ptr_mem_packet[res + 10]	= 0x0d;
		ptr_mem_packet[res + 11]	= 0x0a;

		dev_gps_write( &dev_gps, 0, ptr_mem_packet, res + 12 );

		ch_l = 1;
		while( ch_l )
		{
			res = rt_mq_recv( &mq_gps, (void*)&uart_buf, NEMA_SIZE, RT_TICK_PER_SECOND * 12 );
			if( res == RT_EOK ) //收到一包数据
			{
				if( uart_buf.wr == 11 )
				{
					if( uart_buf.body[4] == 0x02 )
					{
						dev_gps_write( &dev_gps, 0, "\x40\x34\xC0\x00\x34\x00\x01\x84\x6B\x0D\x0A", 11 );
						msg( "E升级完成" );
						rt_kprintf( "\n北斗升级完成" );
						goto end_upgrade_usb_2;
					}
					sprintf( buf, "I发送第%d包", packet_num );
					rt_kprintf( "\n发送第%d包", packet_num );
					msg( buf );
					ch_l = 0;
				}
			}else /*超时*/
			{
				msg( "E升级错误" );
				goto end_upgrade_usb_2;
			}
		}
	}

end_upgrade_usb_2:
	GPIO_ResetBits( GPIOD, GPIO_Pin_10 );
	rt_thread_delay( RT_TICK_PER_SECOND * 3 );
	GPIO_SetBits( GPIOD, GPIO_Pin_10 );
end_upgrade_usb_1:
	if( fd >= 0 )
	{
		close( fd );
	}
end_upgrade_usb_0:
	rt_free( ptr_mem_packet );
	ptr_mem_packet = RT_NULL;
	rt_thread_resume( &thread_gps );
	rt_thread_delay(RT_TICK_PER_SECOND*5);
}

/*gps升级*/
rt_err_t gps_upgrade( void )
{
	rt_thread_t tid;
	tid = rt_thread_create( "upgrade", thread_gps_upgrade_udisk, (void*)msg_uart_usb, 1024, 5, 5 );
	if( tid != RT_NULL )
	{
		rt_thread_startup( tid );
	}else
	{
		rt_kprintf( "\n Upgrade from usb fail\n" );
	}
}

FINSH_FUNCTION_EXPORT( gps_upgrade, upgrade bd_gps );


/*
   查询设置bdgps模式
   0:查询

   const char BD_MODE[]={"$CCSIR,1,0*49\r\n"};
   const char GPS_MODE[]={"$CCSIR,2,0*4A\r\n"};
   const char GPSBD_MODE[]={"$CCSIR,3,0*4B\r\n"};
 */
rt_size_t gps_mode( uint8_t mode )
{
	switch( mode )
	{
		case 0:
			break;
		case 1: /*BD*/
			dev_gps_write( &dev_gps, 0, "$CCSIR,1,0*49\r\n", 15 );
			break;
		case 2: /*GPS*/
			dev_gps_write( &dev_gps, 0, "$CCSIR,2,0*4A\r\n", 15 );
			break;
		case 3: /*BDGPS*/
			dev_gps_write( &dev_gps, 0, "$CCSIR,3,0*4B\r\n", 15 );
			break;
	}
}

FINSH_FUNCTION_EXPORT( gps_mode, change mode );

/************************************** The End Of File **************************************/

